In [1]:
# Pandas
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

# SQL Alchemy
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy import exc
from sqlalchemy import event
from sqlalchemy import select
from sqlalchemy.orm import Session
from sqlalchemy.ext.automap import automap_base
pg_user = "postgres"
pg_pwd = "postgres"
pg_port = "5432"
connstring = "postgres://{username}:{password}@localhost:{port}/Employee_db".format(username=pg_user, password=pg_pwd, port=pg_port)

In [2]:
# Create Engine for Departments data
engine=create_engine(connstring)
conn = engine.connect()

In [3]:
departments_table=pd.read_sql("SELECT * FROM departments", conn)

In [4]:
# Query All Records in the the Salary Table
salaries=pd.read_sql("SELECT * FROM salary", conn)
salaries.head()

   emp_no      salary   from_date     to_date
0   10001  $60,117.00  1986-06-26  1987-06-26
1   10002  $65,828.00  1996-08-03  1997-08-03
2   10003  $40,006.00  1995-12-03  1996-12-02
3   10004  $40,054.00  1986-12-01  1987-12-01
4   10005  $78,228.00  1989-09-12  1990-09-12

In [ ]:
salaries.hist()

In [5]:
# Query All Records in the the Salary Table
title=pd.read_sql("SELECT * FROM titles", conn)
title.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [12]:
merge_pd = pd.merge(title,salaries, on = "emp_no", how = "outer")

In [9]:
title_grp = merge_pd.groupby('title')
title_grp

In [13]:
x_axis = np.arange(len(merge_pd))
tick_locations = [value+0.4 for value in x_axis]

In [ ]:
plt.figure(figsize=(20,3))
plt.bar(x_axis, merge_pd["salary"], color='r', alpha=0.5, align="edge")
plt.xticks(tick_locations, merge_pd["title"], rotation="vertical")